In [1]:
import pandas as pd
from pandas import ExcelWriter
from pandas import ExcelFile

In [2]:
df=pd.read_excel('./data.xlsx')

In [3]:
df

,Unnamed: 0,address,customer_id,dob,first_name,gender,last_name
0,0,"0142 Powell Ford, Marshalltown, Tanzania",1,1995-07-17,Dawn,F,Washington
1,1,"7401 Jodi Shoal, Jessicastad, Denmark",2,1922-12-18,David,M,Nelson
2,2,"058 Joshua Squares Suite 723, Timothyton, Hear...",3,1974-01-21,Nancy,F,Abbott
3,3,"16832 Brent Trafficway Apt. 200, Rosschester, ...",4,1982-03-16,Elizabeth,F,Stewart
4,4,"8242 Kevin Camp Suite 952, Russellshire, Israel",5,1935-06-11,Ryan,M,Cooper
...,...,...,...,...,...,...,...
975,975,"908 Watson Lake Apt. 888, Port Susanland, Holy...",996,1960-08-12,Christopher,M,Donovan
976,976,"2528 Pierce Brook Apt. 710, North Andrewmouth,...",997,1966-11-01,Nancy,F,Kelly
977,977,"23407 Howell Creek Apt. 121, West Luisville, T...",998,1963-06-10,Melissa,F,King
978,978,"17122 Floyd Hill Suite 266, South Julie, Venez...",999,1945-06-20,Kristin,F,Horton
979,979,"3961 Derrick Harbor, South Ernest, British Ind...",1000,2005-11-12,Laura,F,Ingram

In [10]:



list_to_check= df['customer_id'].tolist()
list_to_check.sort()

In [11]:
gap_list=[]
n= 0
for el in list_to_check:
    if n==0:
        n= el-1    
    if el-n > 1:
        gap_list.extend(range(n+1,el))
    n=el

In [12]:
gap_list

[12,
 29,
 147,
 201,
 252,
 299,
 415,
 445,
 558,
 577,
 615,
 617,
 619,
 661,
 711,
 734,
 784,
 896,
 903,
 990]

In [13]:
df2 = pd.DataFrame({'id':gap_list})
df2.to_excel("Sequence Gaps.xlsx")
print(len(gap_list))

20